{
  "next": "التالي",
  "hello": "مرحبًا بالعالم",
  "password": "كلمة المرور",
  "username": "اسم المستخدم",
  "register": "إنشاء مفتاح",
  "register1": "توليد مفتاح وتشفيره",
  "login": "فك التشفير وتسجيل الدخول",
  "back": "رجوع",
  "setting": "الإعدادات",
  "resetPassword": "إعادة تعيين كلمة المرور",
  "forgotPassword": "نسيت كلمة المرور",
  "logout": "تسجيل الخروج",
  "talkflowid": "مفتاح الهوية",
  "blacklist": "القائمة السوداء",
  "myblacklist": "قائمتي السوداء",
  "addblacklist": "إضافة إلى القائمة السوداء",
  "deleteblacklist": "إزالة من القائمة السوداء",
  "keysecuritydetection": "كشف أمان المفتاح",
  "datamigration": "نقل البيانات",
  "cachemanagement": "إدارة الذاكرة المؤقتة",
  "clearthechatrecords": "مسح سجلات الدردشة",
  "destroythekey": "تدمير المفتاح",
  "accountsettings": "إعدادات الحساب",
  "notify": "إشعار",
  "colosenotify": "تعطيل الإشعارات",
  "Toast": "إشعار منبثق",
  "language": "اللغة",
  "help": "مساعدة",
  "setforme": "إعداد الحساب",
  "mynode": "عقدتي",
  "friendkey": "مفتاح هوية الصديق",
  "addfriend": "إرسال طلب صداقة",
  "close": "إغلاق",
  "addfriend1": "إضافة صديق",
  "addfriend2": "إرسال طلب",
  "remarkname": "ملاحظة",
  "remarks": "معلومات الملاحظة",
  "save": "حفظ",
  "delete": "حذف",
  "hide": "إخفاء",
  "afriend": "علاقة موثقة",
  "sendmessage": "إرسال رسالة",
  "scanner": "ماسح ضوئي",
  "qrcodetool": "أداة رمز الاستجابة السريعة",
  "offlinewebtools": "أدوات ويب غير متصلة",
  "relay": "مرحل",
  "onlineequipment": "أجهزة متصلة",
  "historicalequipment": "أجهزة تاريخية",
  "refreshstatus": "تحديث الحالة",
  "exportdata": "تصدير البيانات",
  "importdata": "استيراد البيانات",
  "datamigrationtalk": "تأكد من أن كلا الجهازين على نفس العقدة أو أنهما أقاما اتصالًا نظيرًا لنظير، وأن كلا الجهازين يمتلكان أزواج مفاتيح مفكوكة التشفير ويظلان متصلين بالإنترنت. يشمل محتوى النقل: البيانات الشخصية الأساسية - جهات الاتصال - قائمة الجلسات - سجلات الدردشة بتنسيق نصي وصوتي AAC.",
  "importdatatalk": "يرجى إدخال رمز المزامنة",
  "importdatatalk1": "بدء الاستيراد",
  "importdatatalk2": "تأكد من أن الجهاز الحالي متصل بنفس العقدة الصالحة مثل جهاز التصدير",
  "importdatatalk3": "جارٍ استيراد البيانات",
  "importdatatalk4": "التقدم",
  "exportdatatalk1": "بدء التصدير",
  "exportdatatalk2": "جارٍ تجهيز البيانات للتصدير...",
  "exportdatatalk3": "تأكد من أن الجهاز الحالي متصل بعقدة صالحة.",
  "exportdatatalk4": "اكتمل التصدير",
  "exportdatatalk5": "يرجى استخدام رمز المزامنة التالي للاستيراد على الجهاز الجديد",
  "addfriendtalk": "يرجى إدخال رسالة",
  "agree": "موافقة",
  "refuse": "رفض",
  "notethename": "اسم الملاحظة",
  "Remarks": "معلومات الملاحظة",
  "savesettings": "حفظ الإعدادات",
  "deletefriend": "حذف صديق",
  "sending": "جارٍ الإرسال",
  "htmltalk": "هذه أداة لتوليد صفحات ويب غير متصلة. بعد إدخال المحتوى وتحديد كلمة مرور، اختر التشفير وسيتم إرجاع رابط. انسخ الرابط إلى المتصفح للوصول إلى المحتوى المولد. بالطبع، يمكنك أيضًا اختيار عدم تحديد كلمة مرور؛ إنها خيار إضافي.",
  "relaytalk": "يرسل TalkFlow البيانات وينشرها في شبكة موزعة في الوقت الفعلي عبر المرحلات. إنه جوهر كل شيء. بشكل افتراضي، يستخدم عقد نظير رسمية، ولكن يمكنك أيضًا استخدام عقدتك الخاصة أو فتح عقدتك الخاصة للشبكة العامة للتواصل مع المزيد من الأشخاص. أداة إدارة المرحلات جاهزة، وقد خضعت لاختبارات ضغط متعددة، وهي نسخة مستقرة وموثوقة للغاية. قم بتوسيع قائمة المرحلات الخاصة بك!",
  "versiontalk": "ملاحظات الإصدار - v1.0",
  "versiontalk1": "هذا الإصدار لا يتضمن جميع الميزات؛ يرجى انتظار التحديثات. الميزات قيد التطوير تشمل: إشعارات شاشة القفل APNs - نقل موثوق للملفات الكبيرة المشفرة - اتصال صوتي وفيديو مشفر وموثوق في الوقت الفعلي - منفذ محمول لخادم الألعاب - منفذ سطح مكتب أقوى لـ Windows وLinux وmacOS استنادًا إلى ollama - إصدارات Pro وتحكم بالإيماءات في الواقع المختلط لـ Oculus Quest وPico - مجتمع العقد العامة (قد لا يجتاز هذه الميزة المراجعة، لذا تم تأجيلها) - الدردشة الجماعية (تم تنفيذها حاليًا ولكنها غير مستقرة، قد تكون متاحة في الإصدار التالي؛ مستوى التشفير للاتصال الخاص أعلى). الاتصال الخاص المشفر في الإصدار الحالي موثوق. يمكنك الاتصال بعميل سطح المكتب مع ذكاء اصطناعي خاص أو طائرة بدون طيار. لقد فتح منفذ سطح المكتب واجهات الذكاء الاصطناعي والتحكم؛ قم بتهيئة العقدة وأضف الذكاء الاصطناعي كصديق للتواصل مع ذكائك الاصطناعي الخاص عبر شبكة لامركزية."

,
"eula": {
  "title": "最终用户许可协议",
  "lastUpdated": "最后更新：2025年3月12日",
  "sections": {
    "acceptance": {
      "title": "1. 接受条款",
      "content": "使用 TalkFlow（以下简称“本应用”）即表示您同意受本最终用户许可协议（以下简称“EULA”）的约束。如果您不同意，请勿使用本应用。"
    },
    "license": {
      "title": "2. 许可授予",
      "content": "TalkFlow 授予您非独占、不可转让的许可，允许您出于个人或商业目的使用本应用，但须遵守本 EULA 的条款。本应用基于去中心化网络运行，您对数据和密钥的管理由您自行负责。"
    },
    "conduct": {
      "title": "3. 用户行为",
      "content": "您同意不将本应用用于以下用途：<br>- 发布、分享或传输任何不当内容，包括但不限于仇恨言论、骚扰、暴力、色情或非法内容。<br>- 对其他用户实施滥用行为，例如发送垃圾信息、挑衅、威胁或恶意干扰网络节点。<br>- 违反任何适用法律或法规，包括但不限于数据隐私法和通信法规。"
    },
    "moderation": {
      "title": "4. 内容审查",
      "content": "对于通过公共公开节点网络传输的内容，TalkFlow 保留监控、审查和屏蔽违反本 EULA 的用户生成内容的权利。对于私人节点或对等连接中的内容，您自行负责管理。如发现不当内容，您可以通过应用内举报功能或邮箱 zhangguoai888@gmail.com 联系我们进行报告。"
    },
    "termination": {
      "title": "5. 终止",
      "content": "如果您违反本 EULA，我们可能会在通知或不通知的情况下暂停或终止您对本应用的访问权限。去中心化网络中的数据可能仍由其他节点保留，我们对此不承担责任。"
    },
    "warranty": {
      "title": "6. 无担保",
      "content": "本应用按“现状”提供，不提供任何明示或暗示的担保，包括但不限于对去中心化网络稳定性和数据传输可靠性的担保。由于其去中心化特性，服务可用性可能受网络状况影响。"
    },
    "liability": {
      "title": "7. 责任限制",
      "content": "TalkFlow 对因您使用本应用而产生的任何损害（包括但不限于数据丢失、密钥丢失或第三方行为）不承担责任。本应用不提供密钥找回服务，因其去中心化属性，密钥丢失将导致无法访问相关加密数据，请妥善保管您的密钥。"
    },
    "changes": {
      "title": "8. EULA 修改",
      "content": "我们可能会随时更新本 EULA，更新后的版本将在应用内或通过官方渠道发布。继续使用本应用即表示您接受更新后的条款。"
    },
    "contact": {
      "title": "9. 联系方式",
      "content": "如有疑问或需要支持，请通过 zhangguoai888@gmail.com 联系我们。由于本应用去中心化特性，部分问题可能需要您自行排查节点或密钥相关设置。"
    },
    "agreement": {
      "content": "点击“我同意”即表示您已阅读、理解并同意本 EULA 的所有条款，并愿意承担使用去中心化实时通信服务所带来的责任与风险。"
    }
  },
  "buttons": {
    "agree": "我同意",
    "decline": "拒绝"
  }
},
"help1" : "यह एक ऑफलाइन प्राथमिकता वाला संचार ऐप है।",
"help2" : "सभी डेटा केवल आपके स्थानीय डिस्क पर संग्रहीत होते हैं और केवल जरूरत पड़ने पर वितरित नेटवर्क में नवीनतम स्नैपशॉट डेटा के माध्यम से वृद्धिशील रूप से अपडेट किए जाते हैं।",
"help3" : "इसका मतलब है कि आपकी संपर्क सूची और निजी डेटा उन जगहों पर नहीं दिखाई देंगे जिन्हें आपने मैन्युअल रूप से कॉन्फ़िगर नहीं किया है।",
"help4" : "यदि आपको इसे कई डिवाइसों पर उपयोग करने या डिवाइस बदलने की आवश्यकता है, तो सेटिंग्स पेज पर जाएं और डेटा माइग्रेशन चुनें। डेटा को डिवाइस से निर्यात करें और नए डिवाइस पर आयात करें, यह सुनिश्चित करें कि दोनों एक ही कुंजी जोड़ी और पीयर नोड्स का उपयोग करते हैं और लॉगिन स्थिति में रहते हैं। यदि आप अपने स्वयं के पीयर नोड्स का उपयोग करना चाहते हैं, तो आपको उन्हें रिले विकल्पों में मैन्युअल रूप से कॉन्फ़िगर करना होगा; डिफ़ॉल्ट रूप से आधिकारिक नोड्स का उपयोग होता है। स्थानांतरित सामग्री में शामिल हैं: संपर्क सूची, चैट इतिहास, पिछले डिवाइस रिकॉर्ड।",
"help5" : "यदि आप AI और IoT नियंत्रकों की क्षमताओं का विस्तार करना चाहते हैं, तो MacOS या Windows संस्करण का उपयोग करके एक निजी सेवा तैनात करें। सर्वर नोड को मित्र के रूप में जोड़ें। इस तरह, आप अपने मोबाइल डिवाइस का उपयोग करके वितरित नेटवर्क के माध्यम से लंबी दूरी पर AI या ड्रोन जैसे अन्य IoT उपकरणों के साथ संचार कर सकते हैं।",
"help6" : "मित्र कैसे जोड़ें?",
"help7" : "संपर्क पेज के ऊपरी दाएं कोने में विकल्पों में, आप दूसरी पार्टी के सार्वजनिक कुंजी को मैन्युअल रूप से कॉपी-पेस्ट कर सकते हैं या स्कैनर के साथ उनके QR कोड को स्कैन करके मित्र अनुरोध भेज सकते हैं।",
"help8" : "मित्र अनुरोध कैसे स्वीकार करें?",
"help9" : "संपर्क पेज के ऊपरी बाएं कोने में विकल्पों से, आप सीधे मित्र अनुरोध सूची में जा सकते हैं और उन मित्रों को चुन सकते हैं जिन्हें आप जोड़ना चाहते हैं। इसके अलावा, यदि आपको लगता है कि कोई उपयोगकर्ता आपको परेशान कर रहा है, तो हम एक ब्लैकलिस्ट मॉड्यूल प्रदान करते हैं। आप उसे अपनी ब्लैकलिस्ट में जोड़ सकते हैं, और आपको उस उपयोगकर्ता से कोई डेटा प्राप्त नहीं होगा।",
"help10" : "मित्र जोड़ने के बारे में अतिरिक्त जानकारी:",
"help11" : "सुरक्षा कारणों से निजी संचार डेटा स्वचालित रूप से उत्पन्न नहीं होता है, जिसमें पहचान जालसाजी जैसे मुद्दों को रोकना शामिल है। जब आप दूसरी पार्टी के साथ पहली बार संचार करते हैं, तो आपके डिवाइस पर आपके और उनके लिए एक अद्वितीय संचार प्रमाणपत्र और संचार आईडी स्थानीय रूप से उत्पन्न होता है। दूसरी पार्टी को जोड़ने के बाद, उन्हें संपर्क सूची में खोजें, बातचीत पेज पर जाएं, और एक कस्टम संदेश भेजकर स्थानीय रूप से संचार प्रमाणपत्र और आईडी स्थापित करें। दूसरी पार्टी को भी ऐसा ही करना होगा। आपके और दूसरी पार्टी के प्रमाणपत्र स्वतंत्र हैं, लेकिन डिक्रिप्ट करने और संचार करने के लिए दोनों पक्षों के कुंजी जोड़े और प्रमाणपत्र आवश्यक हैं।"

,

  "sponsor": "الرعاية",
  "sponsor1": "ادعم TalkFlow",
  "sponsor2": "انضم إلينا لتسريع الابتكار في الاتصالات. كن راعيًا اليوم!",
  "sponsor3": "سيتم توزيع رعايتك على جميع من ساهموا في TalkFlow!",
  "sponsor4": "سيتم إضافة هويتك إلى قائمة الرعاة في TalkFlow!",
  "sponsor5": "طرق التواصل للرعاية",
  "sponsor6": "مساهمو TalkFlow",
  "sponsor7": "مؤلف TalkFlow - أنشأ المنصة الأساسية لـ TalkFlow ونظام الاتصال القائم على Gun-Relay.",
  "sponsor8": "مؤلف GunJs - قدم لـ TalkFlow قاعدة بيانات موزعة قوية في الوقت الحقيقي.",
  "sponsor9": "مؤلف Gun-Vue وGun-Avatar - قدم لـ TalkFlow مكونات أساسية مستقرة وصور رمزية ممتعة.",
  "sponsor10": "مارك ومساهمو مجتمع Gun مفتوح المصدر تبرعوا بعقود من الجهد مجانًا للجميع، مقدمين لـ TalkFlow دعمًا تقنيًا موثوقًا طويل الأمد ومساعدة.",
  "sponsor11": "تكديس تكنولوجيا TalkFlow",
  "sponsor12": "تم بناء TalkFlow باستخدام أدوات ولغات متطورة لضمان تجربة قوية وقابلة للتطوير:",
  "sponsor13": "لغات البرمجة:",
  "sponsor14": "قاعدة البيانات:",
  "sponsor15": "الأدوات:",

  "github": "نشر المرحل",
  "github1": "GunRelay-TalkFlow هو عقدة مرحل لـ TalkFlow تعتمد على GUN.",
  "github2": "احصل على قدرات اتصال مستقلة من خلال عقدة مرحل لامركزية.",
  "github3": "يمكنك من إعداد عقدة مرحل لـ TalkFlow باستخدام GUN (قاعدة بيانات رسومية لامركزية). توفر عقدة المرحل مزامنة البيانات في الوقت الحقيقي بين الأجهزة، مما يضمن اتصالًا سلسًا وآمنًا. سواء كنت مطورًا أو متحمسًا، فإن نشر مرحلك الخاص هو خطوة حاسمة نحو مستقبل شبكة مش موزعة لامركزية عالمية. عندما نصل إلى المريخ، ستستعيد بسرعة تجربة الشبكة التي كانت لدينا على الأرض.",
  "github4": "زيارة مستودع GitHub"
,"github5": "انشرها بنفسك عبر مستودع GitHub أدناه. يمكنك استخدام الكود المصدري مباشرة لبناء المظهر الذي تفضله أو توسيع الوظائف، وكذلك إنشاء حزمة تثبيت خاصة بك أو تشغيلها مباشرة باستخدام أوامر الطرفية. بمجرد تشغيلها بنجاح، ستبدأ عقدة مرحل لامركزية تلقائيًا دون الحاجة إلى تهيئة إضافية."

}