{
  "next": "अगला",
  "hello": "हाय, विश्व",
  "password": "पासवर्ड",
  "username": "उपयोगकर्ता नाम",
  "register": "कुंजी बनाएं",
  "register1": "कुंजी उत्पन्न करें और एन्क्रिप्ट करें",
  "login": "डिक्रिप्ट करें और लॉगिन करें",
  "back": "वापस",
  "setting": "सेटिंग्स",
  "resetPassword": "पासवर्ड रीसेट करें",
  "forgotPassword": "पासवर्ड भूल गए",
  "logout": "लॉगआउट",
  "talkflowid": "पहचान कुंजी",
  "blacklist": "ब्लैकलिस्ट",
  "myblacklist": "मेरी ब्लैकलिस्ट",
  "addblacklist": "ब्लैकलिस्ट में जोड़ें",
  "deleteblacklist": "ब्लैकलिस्ट से हटाएं",
  "keysecuritydetection": "कुंजी सुरक्षा जांच",
  "datamigration": "डेटा माइग्रेशन",
  "cachemanagement": "कैश प्रबंधन",
  "clearthechatrecords": "चैट रिकॉर्ड साफ करें",
  "destroythekey": "कुंजी नष्ट करें",
  "accountsettings": "खाता सेटिंग्स",
  "notify": "सूचना",
  "colosenotify": "सूचनाएं अक्षम करें",
  "Toast": "टोस्ट सूचना",
  "language": "भाषा",
  "help": "मदद",
  "setforme": "खाता सेटअप",
  "mynode": "मेरा नोड",
  "friendkey": "मित्र की पहचान कुंजी",
  "addfriend": "मित्र अनुरोध भेजें",
  "close": "बंद करें",
  "addfriend1": "मित्र जोड़ें",
  "addfriend2": "अनुरोध भेजें",
  "remarkname": "टिप्पणी",
  "remarks": "टिप्पणी जानकारी",
  "save": "सहेजें",
  "delete": "हटाएं",
  "hide": "छिपाएं",
  "afriend": "सत्यापित संबंध",
  "sendmessage": "संदेश भेजें",
  "scanner": "स्कैनर",
  "qrcodetool": "क्यूआर कोड उपकरण",
  "offlinewebtools": "ऑफलाइन वेब उपकरण",
  "relay": "रिले",
  "onlineequipment": "ऑनलाइन उपकरण",
  "historicalequipment": "ऐतिहासिक उपकरण",
  "refreshstatus": "स्थिति ताज़ा करें",
  "exportdata": "डेटा निर्यात करें",
  "importdata": "डेटा आयात करें",
  "datamigrationtalk": "सुनिश्चित करें कि दोनों डिवाइस एक ही नोड पर हैं या पीयर-टू-पीयर कनेक्शन स्थापित किया गया है, और दोनों डिवाइस के पास डिक्रिप्टेड कुंजी जोड़े हैं और ऑनलाइन हैं। माइग्रेशन सामग्री में शामिल हैं: मूल व्यक्तिगत डेटा - संपर्क - सत्र सूची - टेक्स्ट और AAC ऑडियो प्रारूप में चैट रिकॉर्ड।",
  "importdatatalk": "कृपया सिंक कोड दर्ज करें",
  "importdatatalk1": "आयात शुरू करें",
  "importdatatalk2": "सुनिश्चित करें कि वर्तमान डिवाइस निर्यात डिवाइस के समान मान्य नोड से जुड़ा है",
  "importdatatalk3": "डेटा आयात हो रहा है",
  "importdatatalk4": "प्रगति",
  "exportdatatalk1": "निर्यात शुरू करें",
  "exportdatatalk2": "डेटा निर्यात की तैयारी हो रही है...",
  "exportdatatalk3": "सुनिश्चित करें कि वर्तमान डिवाइस एक मान्य नोड से जुड़ा है।",
  "exportdatatalk4": "निर्यात पूरा हुआ",
  "exportdatatalk5": "नए डिवाइस पर आयात करने के लिए कृपया निम्नलिखित सिंक कोड का उपयोग करें",
  "addfriendtalk": "कृपया संदेश दर्ज करें",
  "agree": "सहमत",
  "refuse": "अस्वीकार",
  "notethename": "टिप्पणी नाम",
  "Remarks": "टिप्पणी जानकारी",
  "savesettings": "सेटिंग्स सहेजें",
  "deletefriend": "मित्र हटाएं",
  "sending": "भेजा जा रहा है",
  "htmltalk": "यह ऑफलाइन वेब पेज उत्पन्न करने के लिए एक उपकरण है। सामग्री दर्ज करने और पासवर्ड सेट करने के बाद एन्क्रिप्शन चुनें, और एक लिंक वापस मिलेगा। लिंक को ब्राउज़र में कॉपी करें ताकि उत्पन्न सामग्री तक पहुंच सकें। बेशक, आप पासवर्ड सेट न करने का विकल्प भी चुन सकते हैं; यह एक अतिरिक्त विकल्प है।",
  "relaytalk": "TalkFlow रियल-टाइम वितरित नेटवर्क में डेटा संचारित और प्रकाशित करने के लिए रिले का उपयोग करता है। यह सब कुछ का मूल है। डिफ़ॉल्ट रूप से यह आधिकारिक पीयर नोड्स का उपयोग करता है, लेकिन आप अपने निजी नोड का उपयोग कर सकते हैं या अपने निजी नोड को सार्वजनिक नेटवर्क पर खोलकर अधिक लोगों से जुड़ सकते हैं। रिले प्रबंधन उपकरण तैयार है, यह कई तनाव परीक्षणों से गुजरा है और एक बहुत ही स्थिर और विश्वसनीय संस्करण है। अपनी रिले सूची का विस्तार करें!",
  "versiontalk": "संस्करण नोट्स - v1.0",
  "versiontalk1": "यह संस्करण सभी सुविधाओं को शामिल नहीं करता; कृपया अपडेट की प्रतीक्षा करें। विकास में चल रही सुविधाओं में शामिल हैं: APNs लॉक स्क्रीन सूचनाएं - विश्वसनीय एन्क्रिप्टेड बड़े फ़ाइल स्थानांतरण - विश्वसनीय एन्क्रिप्टेड रियल-टाइम वॉयस और वीडियो संचार - गेम सर्वर का पोर्टेबल पोर्ट - ollama पर आधारित विंडोज, लिनक्स और मैकओएस के लिए अधिक शक्तिशाली डेस्कटॉप पोर्ट - ओकुलस क्वेस्ट और पिको के लिए प्रो संस्करण और मिश्रित वास्तविकता जेस्चर नियंत्रण संस्करण - सार्वजनिक नोड समुदाय (यह सुविधा समीक्षा पास नहीं कर सकती, इसलिए इसे स्थगित किया गया है) - समूह चैट (वर्तमान में लागू किया गया है लेकिन स्थिर नहीं है, अगले संस्करण में उपलब्ध हो सकता है; निजी संचार का एन्क्रिप्शन स्तर अधिक है)। वर्तमान संस्करण में निजी एन्क्रिप्टेड संचार विश्वसनीय है। आप डेस्कटॉप क्लाइंट के माध्यम से निजी AI या ड्रोन से जुड़ सकते हैं। डेस्कटॉप पोर्ट ने AI और नियंत्रक इंटरफेस खोले हैं; बस नोड कॉन्फ़िगर करें और AI को मित्र के रूप में जोड़ें, आप विकेन्द्रीकृत नेटवर्क के माध्यम से अपने निजी AI से संवाद कर सकते हैं।"


  ,
  "eula": {
    "title": "最终用户许可协议",
    "lastUpdated": "最后更新：2025年3月12日",
    "sections": {
      "acceptance": {
        "title": "1. 接受条款",
        "content": "使用 TalkFlow（以下简称“本应用”）即表示您同意受本最终用户许可协议（以下简称“EULA”）的约束。如果您不同意，请勿使用本应用。"
      },
      "license": {
        "title": "2. 许可授予",
        "content": "TalkFlow 授予您非独占、不可转让的许可，允许您出于个人或商业目的使用本应用，但须遵守本 EULA 的条款。本应用基于去中心化网络运行，您对数据和密钥的管理由您自行负责。"
      },
      "conduct": {
        "title": "3. 用户行为",
        "content": "您同意不将本应用用于以下用途：<br>- 发布、分享或传输任何不当内容，包括但不限于仇恨言论、骚扰、暴力、色情或非法内容。<br>- 对其他用户实施滥用行为，例如发送垃圾信息、挑衅、威胁或恶意干扰网络节点。<br>- 违反任何适用法律或法规，包括但不限于数据隐私法和通信法规。"
      },
      "moderation": {
        "title": "4. 内容审查",
        "content": "对于通过公共公开节点网络传输的内容，TalkFlow 保留监控、审查和屏蔽违反本 EULA 的用户生成内容的权利。对于私人节点或对等连接中的内容，您自行负责管理。如发现不当内容，您可以通过应用内举报功能或邮箱 zhangguoai888@gmail.com 联系我们进行报告。"
      },
      "termination": {
        "title": "5. 终止",
        "content": "如果您违反本 EULA，我们可能会在通知或不通知的情况下暂停或终止您对本应用的访问权限。去中心化网络中的数据可能仍由其他节点保留，我们对此不承担责任。"
      },
      "warranty": {
        "title": "6. 无担保",
        "content": "本应用按“现状”提供，不提供任何明示或暗示的担保，包括但不限于对去中心化网络稳定性和数据传输可靠性的担保。由于其去中心化特性，服务可用性可能受网络状况影响。"
      },
      "liability": {
        "title": "7. 责任限制",
        "content": "TalkFlow 对因您使用本应用而产生的任何损害（包括但不限于数据丢失、密钥丢失或第三方行为）不承担责任。本应用不提供密钥找回服务，因其去中心化属性，密钥丢失将导致无法访问相关加密数据，请妥善保管您的密钥。"
      },
      "changes": {
        "title": "8. EULA 修改",
        "content": "我们可能会随时更新本 EULA，更新后的版本将在应用内或通过官方渠道发布。继续使用本应用即表示您接受更新后的条款。"
      },
      "contact": {
        "title": "9. 联系方式",
        "content": "如有疑问或需要支持，请通过 zhangguoai888@gmail.com 联系我们。由于本应用去中心化特性，部分问题可能需要您自行排查节点或密钥相关设置。"
      },
      "agreement": {
        "content": "点击“我同意”即表示您已阅读、理解并同意本 EULA 的所有条款，并愿意承担使用去中心化实时通信服务所带来的责任与风险。"
      }
    },
    "buttons": {
      "agree": "我同意",
      "decline": "拒绝"
    }
  },
  "help1" : "यह एक ऑफलाइन प्राथमिकता वाला संचार ऐप है।",
"help2" : "सभी डेटा केवल आपके स्थानीय डिस्क पर संग्रहीत होते हैं और केवल जरूरत पड़ने पर वितरित नेटवर्क में नवीनतम स्नैपशॉट डेटा के माध्यम से वृद्धिशील रूप से अपडेट किए जाते हैं।",
"help3" : "इसका मतलब है कि आपकी संपर्क सूची और निजी डेटा उन जगहों पर नहीं दिखाई देंगे जिन्हें आपने मैन्युअल रूप से कॉन्फ़िगर नहीं किया है।",
"help4" : "यदि आपको इसे कई डिवाइसों पर उपयोग करने या डिवाइस बदलने की आवश्यकता है, तो सेटिंग्स पेज पर जाएं और डेटा माइग्रेशन चुनें। डेटा को डिवाइस से निर्यात करें और नए डिवाइस पर आयात करें, यह सुनिश्चित करें कि दोनों एक ही कुंजी जोड़ी और पीयर नोड्स का उपयोग करते हैं और लॉगिन स्थिति में रहते हैं। यदि आप अपने स्वयं के पीयर नोड्स का उपयोग करना चाहते हैं, तो आपको उन्हें रिले विकल्पों में मैन्युअल रूप से कॉन्फ़िगर करना होगा; डिफ़ॉल्ट रूप से आधिकारिक नोड्स का उपयोग होता है। स्थानांतरित सामग्री में शामिल हैं: संपर्क सूची, चैट इतिहास, पिछले डिवाइस रिकॉर्ड।",
"help5" : "यदि आप AI और IoT नियंत्रकों की क्षमताओं का विस्तार करना चाहते हैं, तो MacOS या Windows संस्करण का उपयोग करके एक निजी सेवा तैनात करें। सर्वर नोड को मित्र के रूप में जोड़ें। इस तरह, आप अपने मोबाइल डिवाइस का उपयोग करके वितरित नेटवर्क के माध्यम से लंबी दूरी पर AI या ड्रोन जैसे अन्य IoT उपकरणों के साथ संचार कर सकते हैं।",
"help6" : "मित्र कैसे जोड़ें?",
"help7" : "संपर्क पेज के ऊपरी दाएं कोने में विकल्पों में, आप दूसरी पार्टी के सार्वजनिक कुंजी को मैन्युअल रूप से कॉपी-पेस्ट कर सकते हैं या स्कैनर के साथ उनके QR कोड को स्कैन करके मित्र अनुरोध भेज सकते हैं।",
"help8" : "मित्र अनुरोध कैसे स्वीकार करें?",
"help9" : "संपर्क पेज के ऊपरी बाएं कोने में विकल्पों से, आप सीधे मित्र अनुरोध सूची में जा सकते हैं और उन मित्रों को चुन सकते हैं जिन्हें आप जोड़ना चाहते हैं। इसके अलावा, यदि आपको लगता है कि कोई उपयोगकर्ता आपको परेशान कर रहा है, तो हम एक ब्लैकलिस्ट मॉड्यूल प्रदान करते हैं। आप उसे अपनी ब्लैकलिस्ट में जोड़ सकते हैं, और आपको उस उपयोगकर्ता से कोई डेटा प्राप्त नहीं होगा।",
"help10" : "मित्र जोड़ने के बारे में अतिरिक्त जानकारी:",
"help11" : "सुरक्षा कारणों से निजी संचार डेटा स्वचालित रूप से उत्पन्न नहीं होता है, जिसमें पहचान जालसाजी जैसे मुद्दों को रोकना शामिल है। जब आप दूसरी पार्टी के साथ पहली बार संचार करते हैं, तो आपके डिवाइस पर आपके और उनके लिए एक अद्वितीय संचार प्रमाणपत्र और संचार आईडी स्थानीय रूप से उत्पन्न होता है। दूसरी पार्टी को जोड़ने के बाद, उन्हें संपर्क सूची में खोजें, बातचीत पेज पर जाएं, और एक कस्टम संदेश भेजकर स्थानीय रूप से संचार प्रमाणपत्र और आईडी स्थापित करें। दूसरी पार्टी को भी ऐसा ही करना होगा। आपके और दूसरी पार्टी के प्रमाणपत्र स्वतंत्र हैं, लेकिन डिक्रिप्ट करने और संचार करने के लिए दोनों पक्षों के कुंजी जोड़े और प्रमाणपत्र आवश्यक हैं।"


,
  "sponsor": "प्रायोजन",
  "sponsor1": "TalkFlow का समर्थन करें",
  "sponsor2": "हमारे साथ संचार नवाचार को तेज करें। आज ही प्रायोजक बनें!",
  "sponsor3": "आपका प्रायोजन TalkFlow में योगदान देने वाले सभी लोगों के बीच वितरित किया जाएगा!",
  "sponsor4": "आपकी पहचान TalkFlow के प्रायोजकों की सूची में जोड़ी जाएगी!",
  "sponsor5": "प्रायोजन संपर्क विधियाँ",
  "sponsor6": "TalkFlow योगदानकर्ता",
  "sponsor7": "TalkFlow लेखक - TalkFlow का मुख्य मंच और Gun-Relay आधारित संचार प्रणाली बनाई।",
  "sponsor8": "GunJs लेखक - TalkFlow को एक शक्तिशाली वास्तविक समय वितरित डेटाबेस प्रदान किया।",
  "sponsor9": "Gun-Vue और Gun-Avatar लेखक - TalkFlow को स्थिर आधारभूत घटक और मजेदार अवतार प्रदान किए।",
  "sponsor10": "मार्क और Gun ओपन-सोर्स समुदाय के योगदानकर्ताओं ने दशकों के प्रयास मुफ्त में सभी को दान किए, जिससे TalkFlow को विश्वसनीय दीर्घकालिक तकनीकी समर्थन और सहायता मिली।",
  "sponsor11": "TalkFlow तकनीकी स्टैक",
  "sponsor12": "TalkFlow अत्याधुनिक उपकरणों और भाषाओं के साथ बनाया गया है ताकि एक मजबूत, स्केलेबल अनुभव सुनिश्चित हो:",
  "sponsor13": "प्रोग्रामिंग भाषाएँ:",
  "sponsor14": "डेटाबेस:",
  "sponsor15": "उपकरण:",

  "github": "रिले तैनाती",
  "github1": "GunRelay-TalkFlow एक GUN आधारित TalkFlow रिले नोड है।",
  "github2": "विकेन्द्रीकृत रिले नोड के माध्यम से स्वतंत्र संचार क्षमताएँ प्राप्त करें।",
  "github3": "आपको GUN (एक विकेन्द्रीकृत ग्राफ डेटाबेस) का उपयोग करके TalkFlow के लिए एक रिले नोड सेट करने की अनुमति देता है। रिले नोड डिवाइसों के बीच वास्तविक समय डेटा सिंक्रनाइज़ेशन प्रदान करता है, जिससे निर्बाध और सुरक्षित संचार सुनिश्चित होता है। चाहे आप डेवलपर हों या उत्साही, अपना स्वयं का रिले तैनात करना वैश्विक विकेन्द्रीकृत वितरित मेश नेटवर्क भविष्य की ओर एक महत्वपूर्ण कदम है। जब हम मंगल ग्रह पर पहुँचेंगे, तो यह पृथ्वी पर हमारे नेटवर्क अनुभव को जल्दी से बहाल कर देगा।",
  "github4": "GitHub रिपॉजिटरी पर जाएँ"
,"github5": "नीचे दिए गए GitHub रिपॉजिटरी के माध्यम से इसे स्वयं तैनात करें। आप सीधे स्रोत कोड का उपयोग करके अपनी पसंद का रूप बना सकते हैं या कार्यक्षमता का विस्तार कर सकते हैं, साथ ही अपना स्वयं का इंस्टॉलेशन पैकेज बना सकते हैं या टर्मिनल कमांड का उपयोग करके इसे सीधे चला सकते हैं। सफलतापूर्वक चलने पर, यह स्वचालित रूप से एक विकेन्द्रीकृत रिले नोड शुरू कर देगा, बिना किसी अतिरिक्त कॉन्फ़िगरेशन के।"


}