{
  "next": "Suivant",
  "hello": "Bonjour le Monde",
  "password": "Mot de passe",
  "username": "Nom d'utilisateur",
  "register": "S'inscrire",
  "register1": "Générer une clé et chiffrer",
  "login": "Se connecter",
  "back": "Retour",
  "setting": "Paramètres",
  "resetPassword": "Réinitialiser le mot de passe",
  "forgotPassword": "Mot de passe oublié",
  "logout": "Se déconnecter",
  "talkflowid": "Clé d'identité",
  "blacklist": "Liste noire",
  "myblacklist": "Ma liste noire",
  "addblacklist": "Ajouter à la liste noire",
  "deleteblacklist": "Retirer de la liste noire",
  "keysecuritydetection": "Détection de la sécurité de la clé",
  "datamigration": "Migration des données",
  "cachemanagement": "Gestion du cache",
  "clearthechatrecords": "Effacer les historiques de chat",
  "destroythekey": "Détruire la clé",
  "accountsettings": "Paramètres du compte",
  "notify": "Notification",
  "colosenotify": "Désactiver les notifications",
  "Toast": "Notification toast",
  "language": "Langue",
  "help": "Aide",
  "setforme": "Configuration du compte",
  "mynode": "Mon nœud",
  "friendkey": "Clé d'identité de l'ami",
  "addfriend": "Envoyer une demande d'ami",
  "close": "Fermer",
  "addfriend1": "Ajouter un ami",
  "addfriend2": "Envoyer une demande",
  "remarkname": "Remarque",
  "remarks": "Informations de la remarque",
  "save": "Sauvegarder",
  "delete": "Supprimer",
  "hide": "Masquer",
  "afriend": "Relation vérifiée",
  "sendmessage": "Envoyer un message",
  "scanner": "Scanner",
  "qrcodetool": "Outil de code QR",
  "offlinewebtools": "Outils web hors ligne",
  "relay": "Relais",
  "onlineequipment": "Appareils en ligne",
  "historicalequipment": "Appareils historiques",
  "refreshstatus": "Actualiser l'état",
  "exportdata": "Exporter les données",
  "importdata": "Importer les données",
  "datamigrationtalk": "Assurez-vous que les deux appareils sont sur le même nœud ou ont établi une connexion peer-to-peer, et que les deux appareils possèdent des paires de clés déchiffrées et restent en ligne. Le contenu de la migration inclut : données personnelles de base - contacts - liste des sessions - historiques de chat au format texte et audio AAC.",
  "importdatatalk": "Veuillez entrer le code de synchronisation",
  "importdatatalk1": "Démarrer l'importation",
  "importdatatalk2": "Assurez-vous que l'appareil actuel est connecté au même nœud valide que l'appareil d'exportation",
  "importdatatalk3": "Importation des données en cours",
  "importdatatalk4": "Progression",
  "exportdatatalk1": "Démarrer l'exportation",
  "exportdatatalk2": "Préparation de l'exportation des données...",
  "exportdatatalk3": "Assurez-vous que l'appareil actuel est connecté à un nœud valide.",
  "exportdatatalk4": "Exportation terminée",
  "exportdatatalk5": "Veuillez utiliser le code de synchronisation suivant pour importer sur le nouvel appareil",
  "addfriendtalk": "Veuillez entrer un message",
  "agree": "Accepter",
  "refuse": "Refuser",
  "notethename": "Nom de la remarque",
  "Remarks": "Informations de la remarque",
  "savesettings": "Sauvegarder les paramètres",
  "deletefriend": "Supprimer un ami",
  "sending": "Envoi en cours",
  "htmltalk": "Ceci est un outil pour générer des pages web hors ligne. Après avoir entré le contenu et défini un mot de passe, sélectionnez le chiffrement et un lien sera retourné. Copiez simplement le lien dans un navigateur pour accéder au contenu généré. Bien sûr, vous pouvez également choisir de ne pas définir de mot de passe ; c'est une option supplémentaire.",
  "relaytalk": "TalkFlow transmet et publie des données dans un réseau distribué en temps réel via des relais. C'est le cœur de tout. Par défaut, il utilise des nœuds peer officiels, mais vous pouvez aussi utiliser votre propre nœud privé ou ouvrir votre nœud privé au réseau public pour vous connecter avec plus de personnes. L'outil de gestion des relais est prêt, il a passé de multiples tests de stress et est une version très stable et fiable. Élargissez votre liste de relais !",
  "versiontalk": "Notes de version - v1.0",
  "versiontalk1": "Cette version n'inclut pas toutes les fonctionnalités ; veuillez attendre les mises à jour. Les fonctionnalités en cours de développement incluent : notifications sur l'écran de verrouillage APNs - transfert fiable de gros fichiers chiffrés - communication vocale et vidéo en temps réel chiffrée et fiable - port portable pour serveur de jeu - un port de bureau plus puissant pour Windows, Linux et macOS basé sur ollama - versions Pro et contrôle gestuel en réalité mixte pour Oculus Quest et Pico - communauté de nœuds publics (cette fonctionnalité pourrait ne pas passer la révision, elle est donc en attente) - chat de groupe (actuellement implémenté mais pas stable, pourrait être disponible dans la prochaine version ; la communication privée a un niveau de chiffrement plus élevé). La communication chiffrée privée dans la version actuelle est fiable. Vous pouvez vous connecter à un client de bureau avec une IA privée ou un drone. Le port de bureau a ouvert des interfaces pour l'IA et les contrôleurs ; configurez simplement le nœud et ajoutez l'IA comme ami pour communiquer avec votre IA privée via un réseau décentralisé."

,
  "eula": {
    "title": "Accord de Licence d'Utilisateur Final",
    "lastUpdated": "Dernière mise à jour : 12 mars 2025",
    "sections": {
      "acceptance": {
        "title": "1. Acceptation des Conditions",
        "content": "L'utilisation de TalkFlow (ci-après \"l'Application\") indique que vous acceptez d'être lié par cet Accord de Licence d'Utilisateur Final (ci-après \"EULA\"). Si vous n'êtes pas d'accord, veuillez ne pas utiliser l'Application."
      },
      "license": {
        "title": "2. Octroi de Licence",
        "content": "TalkFlow vous accorde une licence non exclusive et non transférable pour utiliser l'Application à des fins personnelles ou commerciales, sous réserve du respect des conditions de cet EULA. L'Application fonctionne sur un réseau décentralisé, et vous êtes responsable de la gestion de vos données et clés."
      },
      "conduct": {
        "title": "3. Comportement de l'Utilisateur",
        "content": "Vous acceptez de ne pas utiliser l'Application pour :<br>- Publier, partager ou transmettre tout contenu inapproprié, y compris mais sans s'y limiter, les discours de haine, le harcèlement, la violence, la pornographie ou le contenu illégal.<br>- Commettre des abus envers d'autres utilisateurs, tels que l'envoi de spam, la provocation, les menaces ou l'interférence malveillante avec les nœuds réseau.<br>- Violer toute loi ou réglementation applicable, y compris mais sans s'y limiter, les lois sur la confidentialité des données et les réglementations de communication."
      },
      "moderation": {
        "title": "4. Modération du Contenu",
        "content": "Pour le contenu transmis via le réseau de nœuds publics, TalkFlow se réserve le droit de surveiller, examiner et bloquer le contenu généré par les utilisateurs qui viole cet EULA. Pour le contenu dans les nœuds privés ou les connexions peer-to-peer, vous êtes responsable de la gestion. Si vous trouvez du contenu inapproprié, vous pouvez nous le signaler via la fonction de signalement dans l'application ou par email à zhangguoai888@gmail.com."
      },
      "termination": {
        "title": "5. Résiliation",
        "content": "Si vous violez cet EULA, nous pouvons suspendre ou résilier votre accès à l'Application avec ou sans préavis. Les données dans le réseau décentralisé peuvent toujours être conservées par d'autres nœuds, et nous ne sommes pas responsables de cela."
      },
      "warranty": {
        "title": "6. Absence de Garantie",
        "content": "L'Application est fournie \"en l'état\" sans aucune garantie expresse ou implicite, y compris mais sans s'y limiter, les garanties de stabilité du réseau décentralisé et de fiabilité de transmission des données. En raison de sa nature décentralisée, la disponibilité du service peut être affectée par les conditions du réseau."
      },
      "liability": {
        "title": "7. Limitation de Responsabilité",
        "content": "TalkFlow n'est pas responsable de tout dommage résultant de votre utilisation de l'Application (y compris mais sans s'y limiter, la perte de données, la perte de clés ou les actions de tiers). L'Application ne fournit pas de service de récupération de clés, en raison de ses propriétés décentralisées, la perte de clés entraînera l'impossibilité d'accéder aux données cryptées associées, veuillez garder vos clés en sécurité."
      },
      "changes": {
        "title": "8. Modifications de l'EULA",
        "content": "Nous pouvons mettre à jour cet EULA à tout moment, les versions mises à jour seront publiées dans l'Application ou via les canaux officiels. Continuer à utiliser l'Application indique que vous acceptez les conditions mises à jour."
      },
      "contact": {
        "title": "9. Contact",
        "content": "Si vous avez des questions ou avez besoin d'assistance, veuillez nous contacter à zhangguoai888@gmail.com. En raison de la nature décentralisée de l'Application, certains problèmes peuvent nécessiter que vous diagnostiquiez vous-même les paramètres liés aux nœuds ou aux clés."
      },
      "agreement": {
        "content": "En cliquant sur \"J'accepte\", vous indiquez que vous avez lu, compris et accepté tous les termes de cet EULA, et êtes prêt à assumer les responsabilités et risques liés à l'utilisation du service de communication décentralisé en temps réel."
      }
    },
    "buttons": {
      "agree": "J'accepte",
      "decline": "Refuser"
    }
  },
"help1" : "Ceci est une application de communication privilégiant le mode hors ligne.",
"help2" : "Toutes les données sont stockées uniquement sur votre disque local et sont mises à jour de manière incrémentielle via les dernières données d'instantanés provenant d'un réseau distribué, uniquement lorsque cela est nécessaire.",
"help3" : "Cela signifie que votre liste de contacts et vos données privées n'apparaîtront nulle part sauf là où vous les avez configurées manuellement.",
"help4" : "Si vous avez besoin de l'utiliser sur plusieurs appareils ou de changer d'appareil, accédez à la page des paramètres et sélectionnez la migration des données. Exportez les données depuis l'appareil et importez-les sur le nouvel appareil, en vous assurant que les deux utilisent la même paire de clés et les mêmes nœuds pairs, tout en restant connectés. Si vous souhaitez utiliser vos propres nœuds pairs, vous devez les configurer manuellement dans les options de relais ; par défaut, les nœuds officiels sont utilisés. Le contenu transféré inclut : la liste de contacts, l'historique des discussions et les enregistrements des appareils précédents.",
"help5" : "Si vous souhaitez étendre les capacités d'IA et des contrôleurs IoT, utilisez la version pour MacOS ou Windows pour déployer un service privé. Ajoutez le nœud serveur en tant qu'ami. Ainsi, vous pourrez communiquer à longue distance via un réseau distribué avec une IA ou d'autres appareils IoT, comme des drones, en utilisant votre appareil mobile.",
"help6" : "Comment ajouter un ami ?",
"help7" : "Dans les options en haut à droite de la page des contacts, vous pouvez choisir de copier-coller manuellement la clé publique de l'autre personne ou de scanner son code QR avec le scanner pour envoyer une demande d'ami.",
"help8" : "Comment accepter une demande d'ami ?",
"help9" : "Dans les options en haut à gauche de la page des contacts, vous pouvez accéder directement à la liste des demandes d'amis et sélectionner les amis que vous souhaitez ajouter. De plus, si vous pensez être harcelé par un utilisateur, nous proposons un module de liste noire. Vous pouvez l'ajouter à votre liste noire et vous ne recevrez plus aucune donnée de cet utilisateur.",
"help10" : "Notes supplémentaires sur l'ajout d'amis :",
"help11" : "Les données de communication privée ne sont pas générées automatiquement pour des raisons de sécurité, notamment pour éviter des problèmes comme l'usurpation d'identité. Lors de votre première communication avec l'autre personne, un certificat de communication unique et un identifiant de communication seront générés localement sur votre appareil pour vous et pour elle. Après avoir ajouté l'autre personne, trouvez-la dans la liste des contacts, cliquez pour accéder à la page de conversation et envoyez un message personnalisé pour établir localement le certificat de communication et l'identifiant. L'autre personne doit faire de même. Les certificats entre vous et l'autre personne sont indépendants, mais la paire de clés et le certificat des deux parties sont nécessaires pour déchiffrer et communiquer.",
  "sponsor": "Parrainage",
  "sponsor1": "Soutenir TalkFlow",
  "sponsor2": "Rejoignez-nous pour accélérer l'innovation en communication. Devenez parrain dès aujourd'hui !",
  "sponsor3": "Votre parrainage sera distribué à tous ceux qui ont contribué à TalkFlow !",
  "sponsor4": "Votre identité sera ajoutée à la liste des parrains de TalkFlow !",
  "sponsor5": "Méthodes de contact pour le parrainage",
  "sponsor6": "Contributeurs ",
  "sponsor7": "Auteur de TalkFlow - A créé la plateforme principale de TalkFlow et le système de communication basé sur Gun-Relay.",
  "sponsor8": "Auteur de GunJs - A fourni à TalkFlow une puissante base de données distribuée en temps réel.",
  "sponsor9": "Auteur de Gun-Vue et Gun-Avatar - A fourni à TalkFlow des composants de base stables et des avatars amusants.",
  "sponsor10": "Mark et les contributeurs de la communauté open-source de Gun ont offert gratuitement des décennies d'efforts à tous, fournissant à TalkFlow un support technique fiable à long terme et une assistance.",
  "sponsor11": "Pile technologique de TalkFlow",
  "sponsor12": "TalkFlow est construit avec des outils et des langages de pointe pour garantir une expérience robuste et évolutive :",
  "sponsor13": "Langages de programmation :",
  "sponsor14": "Base de données :",
  "sponsor15": "Outils :",

  "github": "Déploiement de relais",
  "github1": "GunRelay-TalkFlow est un nœud de relais TalkFlow basé sur GUN.",
  "github2": "Obtenez des capacités de communication indépendantes grâce à un nœud de relais décentralisé.",
  "github3": "Vous permet de configurer un nœud de relais pour TalkFlow en utilisant GUN (une base de données graphique décentralisée). Le nœud de relais assure la synchronisation des données en temps réel entre les appareils, garantissant une communication fluide et sécurisée. Que vous soyez développeur ou passionné, déployer votre propre relais est une étape cruciale vers un avenir de réseau maillé distribué décentralisé mondial. Lorsque nous atteindrons Mars, il restaurera rapidement l'expérience réseau que nous avions sur Terre.",
  "github4": "Visiter le dépôt GitHub",
  "github5": "Déployez-le vous-même via le dépôt GitHub ci-dessous. Vous pouvez utiliser directement le code source pour construire l'apparence que vous préférez ou étendre les fonctionnalités, ainsi que créer votre propre paquet d'installation ou l'exécuter directement avec des commandes de terminal. Une fois exécuté avec succès, un nœud de relais décentralisé démarrera automatiquement sans configuration supplémentaire.",
  "dAi": "Intelligence Artificielle Décentralisée",
  "dAi1": "Intelligence Artificielle Décentralisée - Robots - Drones - Installations de Communication",
  "dAi2": "IA Privée",
  "dAi3": "Nous voulons tous posséder quelque chose qui nous appartient vraiment, et l'intelligence artificielle ne fait pas exception. Nous sommes prêts pour vous.",
  "dAi4": "Comment utiliser",
  "dAi5": "Lancez Ollama, lancez la version de bureau de TalkFlow et créez une identité décentralisée pour l'IA. Utilisez votre identité pour établir une amitié avec l'IA en scannant le code ou en copiant la clé publique. Ouvrez Chatbot dans Discover pour accéder à la page de configuration de l'IA. Activez la réponse automatique de l'IA et sélectionnez les amis qui ont besoin de services d'IA dans la liste d'amis. Maintenant, vous pouvez rester en contact avec votre IA privée.",
  "dAi6": "Nous n'avons pas intégré Ollama dans l'application car cela augmenterait la taille du paquet d'installation. De plus, vous avez peut-être déjà installé Ollama.",
  "dAi7": "Open Source",
  "dAi8": "Nous avons ouvert le code source. Vous pouvez le construire et le lancer directement via le code source en suivant le contenu de la documentation du référentiel, ou vous pouvez construire le paquet d'installation vous-même. Ou téléchargez directement le paquet d'installation officiel pour l'installation.",
  "dAi9": "Nous autorisons l'extension des fonctionnalités et les améliorations basées sur le code, et nous accueillons favorablement l'envoi de PR et la participation au développement pour devenir un contributeur open source. Si vous devez redistribuer l'application, vous devez indiquer dans l'application que l'infrastructure provient des équipes TalkFlow et Gun, et mentionner la source du code. Veuillez respecter notre protocole open source. Nous fournirons une assistance technique à long terme et des services de sécurité. Vous pouvez nous contacter via X pour envoyer une notification urgente, et nous agirons dans un délai de 1 jour.",


  "inputMomentContent": "Veuillez saisir le contenu du moment",
  "momentPublished": "Moment publié avec succès",
  "momentPublishFailed": "Échec de la publication du moment",
  "sent": "Envoyé",
  "sendFailed": "Échec de l'envoi, veuillez réessayer",
  "forwarded": "Transféré",
  "forwardFailed": "Échec du transfert, veuillez réessayer",
  "likeSuccess": "Aimé avec succès",
  "unlikeSuccess": "Désaimé avec succès",
  "commentSuccess": "Commentaire publié avec succès",
  "replySuccess": "Réponse publiée avec succès",
  "commentDeleted": "Commentaire supprimé avec succès",
  "pleaseLogin": "Veuillez vous connecter d'abord",
  "invalidOperation": "Opération invalide",
  "momentNotFound": "Moment non trouvé",
  "loadMoreSuccess": "Plus d'historique chargé avec succès",
  "loadMoreFailed": "Échec du chargement de plus d'historique",
  "momentHidden": "Moment masqué",
  "momentPublic": "Moment rendu public",
  "momentDeleteSuccess": "Moment supprimé avec succès",
  "momentDeleteFailed": "Échec de la suppression du moment",
  "likeFailed": "Échec de l'appréciation",
  "unlikeFailed": "Échec de la suppression de l'appréciation",
  "originalMomentNotFound": "Moment original non trouvé",
  "cannotForwardForward": "Impossible de transférer un moment transféré",
  "commentFailed": "Échec du commentaire",
  "replyFailed": "Échec de la réponse",
  "deleteCommentFailed": "Échec de la suppression du commentaire",
  "noPermissionDelete": "Aucune autorisation pour supprimer ce commentaire",
  "databaseWriteError": "Erreur d'écriture dans la base de données",
  "unknownError": "Erreur inconnue",
  "sayPlaceholder": "Dites quelque chose...",
  "post": "Publier",
  "loading": "Chargement...",
  "noCommentsYet": "Aucun commentaire pour l'instant. Soyez le premier à commenter !",
  "reply": "Répondre",
  "delete": "Supprimer",
  "replyingTo": "En réponse à",
  "inputValueNull": "La valeur d'entrée est nulle",
  "errorAboutId": "Erreur concernant l'ID",
  "searchingUser": "Recherche d'utilisateur...",
  "userNotFound": "Utilisateur non trouvé",
  "searchFailed": "Échec de la recherche, veuillez réessayer",
  "failedOpenProfile": "Échec de l'ouverture du profil",
  "copied": "Copié",
  "pullToRefresh": "Tirez vers le bas pour actualiser",
  "loadingMore": "Chargement de plus...",
  "noMoreData": "Aucune donnée supplémentaire",
  "invalidDate": "Date invalide",
  "me": "Moi",
  "loadingText": "Chargement...",
  "forwardContentTooLong": "Le contenu du transfert ne peut pas dépasser 280 caractères",
  "postingMoment": "Publication de votre moment...",
  "failedLoadImage": "Échec du chargement de l'image",
  "failedReadFile": "Échec de la lecture du fichier",
  "failedCompressImage": "Échec de la compression de l'image",
  "refreshMomentsFailed": "Échec de l'actualisation des moments",
  "loadMoreMomentsFailed": "Échec du chargement de plus de moments",
  "refreshMomentsSuccess": "Liste des moments actualisée avec succès",
  "refreshMomentsFail": "Échec de l'actualisation de la liste des moments",
  "forwardPost": "Transférer la publication",
  "forwarding": "Transfert en cours...",
  "forwardedFrom": "Transféré de",
  "forward": "Transférer",
  "clickToViewOriginal": "Cliquer pour voir l'original",
  "originalMomentDeleted": "Moment original supprimé",
  "themes": "Thèmes",
  "customizeColors": "Personnalisez votre expérience",
  "userAgreement": "Accord Utilisateur",
  "termsAndFeaturesGuide": "Conditions et Guide des Fonctionnalités",
  "successfulLoginImpliesAgreement": "La connexion réussie implique l'acceptation de toutes les conditions",
  "userAgreementAndFeatures": "Accord Utilisateur et Fonctionnalités",
  "loginToTalkFlow": "Se connecter à TalkFlow",
  "createNewAccount": "Créer un Nouveau Compte",
  "colorThemes": "Thèmes de Couleur",
  "generateAvatar": "Générer Avatar",
  "regenerateAvatar": "Régénérer",
  "key": "Clé",
  "keyColon": "Clé:",
  "copy": "Copier",
  "decentralizedDesign": "Conception Décentralisée",
  "decentralizedDesignDesc": "TalkFlow fonctionne sur un réseau pair-à-pair utilisant Gun.js. Vos données sont distribuées sur les nœuds, garantissant aucun point de défaillance unique. Vous maintenez un contrôle complet sur votre identité numérique et vos communications.",
  "endToEndEncryption": "Chiffrement de Bout en Bout",
  "endToEndEncryptionDesc": "Tous les messages, fichiers et communications sont chiffrés en utilisant la cryptographie SEA. Seuls vous et vos destinataires prévus peuvent déchiffrer et lire votre contenu. Votre vie privée est mathématiquement garantie.",
  "aiIntegration": "Intégration IA",
  "aiIntegrationDesc": "Amélioré avec des capacités d'IA locales et cloud, supportant les conversations intelligentes, la génération d'images et la reconnaissance de contenu. Le traitement IA fonctionne en sécurité sans compromettre votre vie privée.",
  "userConductGuidelines": "Lignes Directrices de Conduite Utilisateur",
  "userConductGuidelinesDesc": "Vous acceptez de ne pas : publier de contenu inapproprié (discours de haine, harcèlement, violence, pornographie), adopter un comportement abusif (spam, menaces, interférence malveillante), ou violer les lois applicables.",
  "privacyAndSecurity": "Confidentialité et Sécurité",
  "privacyAndSecurityDesc": "Nous ne stockons pas vos clés privées ni n'accédons à vos données chiffrées. Vous êtes responsable de la gestion des clés et de la sécurité. Les clés perdues ne peuvent pas être récupérées - vos données seront définitivement inaccessibles.",
  "contentModeration": "Modération de Contenu",
  "contentModerationDesc": "Pour les canaux dynamiques publics, nous nous réservons le droit de surveiller et bloquer le contenu violant. Pour les nœuds privés et les fonctions de communication, vous gérez le contenu vous-même. Si vous découvrez un comportement inapproprié, veuillez le signaler à zhangguoai888@gmail.com.",
  "legalTerms": "Conditions Légales",
  "legalTermsDesc": "TalkFlow est fourni \"tel quel\" sans garanties. Nous ne sommes pas responsables de la perte de données, de la perte de clés, ou des actions de tiers. La disponibilité du service peut varier en raison des conditions réseau.",
  "agreementUpdates": "Mises à Jour de l'Accord",
  "agreementUpdatesDesc": "Nous pouvons mettre à jour ces conditions à tout moment. L'utilisation continue constitue l'acceptation des conditions mises à jour. Les changements seront publiés par les canaux officiels.",
  "importantNotice": "Avis Important",
  "importantNoticeDesc": "La connexion réussie implique l'acceptation de tous les termes et conditions. En continuant à vous connecter, vous confirmez la compréhension et l'accord à ces conditions.",
  "privacyProtection": "Protection de la Vie Privée",
  "privacyProtectionDesc": "TalkFlow utilise la technologie de chiffrement de bout en bout. Tous vos messages, fichiers et communications sont chiffrés localement avant transmission. Nous ne pouvons pas et n'accédons pas au contenu de vos communications privées.",
  "dataCollection": "Collection de Données",
  "dataCollectionDesc": "Nous ne collectons pas d'informations personnelles, de journaux de chat, ou de contenu de messages. L'architecture décentralisée garantit que vos données restent distribuées sur les nœuds réseau que vous choisissez de connecter.",
  "networkInformation": "Informations Réseau",
  "networkInformationDesc": "Pour la fonctionnalité réseau, nous pouvons traiter les métadonnées de connexion (adresses IP, statut des nœuds). Ces informations techniques sont nécessaires pour la communication pair-à-pair mais ne sont pas associées à votre identité.",
  "keyManagement": "Gestion des Clés",
  "keyManagementDesc": "Vos clés de chiffrement sont générées et stockées localement sur votre appareil. Nous ne pouvons pas accéder à vos clés privées, donc ne pouvons pas déchiffrer vos données ou récupérer les clés perdues.",
  "serviceAvailability": "Disponibilité du Service",
  "serviceAvailabilityDesc": "TalkFlow fonctionne sur un réseau décentralisé. La disponibilité du service dépend des nœuds réseau maintenus par la communauté. Nous visons une haute disponibilité mais ne pouvons garantir un accès ininterrompu.",
  "dataPersistence": "Persistance des Données",
  "dataPersistenceDesc": "Vos données sont distribuées sur les nœuds réseau. La persistance des données dépend des opérateurs de nœuds et de la santé du réseau. Nous recommandons des sauvegardes régulières d'informations importantes et de clés cryptographiques.",
  "serviceLimitations": "Limitations du Service",
  "serviceLimitationsDesc": "S'il y a un comportement abusif, nous nous réservons le droit de restreindre l'accès aux nœuds de relais publics. Les nœuds privés restent sous votre contrôle complet. Les limitations de taille de fichier et de transfert peuvent s'appliquer selon les conditions réseau.",
  "technicalSupport": "Support Technique",
  "technicalSupportDesc": "Le support communautaire est disponible par les canaux officiels. Pour les problèmes techniques, veuillez d'abord consulter la documentation ou contacter : zhangguoai888@gmail.com",
  "disclaimer": "Avis de Non-Responsabilité",
  "disclaimerDesc": "TalkFlow est fourni \"tel quel\" et \"tel que disponible\" sans garanties d'aucune sorte, expressément ou implicitement. Nous ne garantissons pas que le service sera ininterrompu, sans erreur, ou sécurisé.",
  "limitationOfLiability": "Limitation de Responsabilité",
  "limitationOfLiabilityDesc": "En aucun cas les développeurs TalkFlow ne seront responsables de dommages directs, indirects, accessoires, spéciaux, ou consécutifs résultant de l'utilisation ou de l'incapacité d'utiliser le service.",
  "applicableLaw": "Loi Applicable",
  "applicableLawDesc": "Ces conditions sont régies par le droit international applicable. Les disputes seront résolues par arbitrage. Si un terme est trouvé invalide, les termes restants continueront d'être effectifs.",
  "finalAgreement": "Accord Final",
  "finalAgreementDesc": "Utiliser TalkFlow signifie que vous avez lu, compris, et accepté d'être lié par tous les termes et conditions décrits dans cet accord. Ceci constitue l'accord complet entre vous et TalkFlow.",
  "talkflowTheme": "TalkFlow",
  "purpleTheme": "Violet",
  "neonTheme": "Néon",
  "auroraTheme": "Aurore",
  "blackWhiteTheme": "Noir et Blanc",
  "deepSpaceTheme": "Espace Profond",
  "fireTheme": "Feu",
  "oceanTheme": "Océan",
  "forestTheme": "Forêt",
  "cosmicTheme": "Cosmique",
  "goldTheme": "Or",
  "roseTheme": "Rose",
  "emeraldTheme": "Émeraude",
  "mysticalTheme": "Mystique",
  "glacierTheme": "Glacier",
  "volcanicTheme": "Volcanique",
  
  "currentNode": "Nœud actuel:",
  "noNodeSelected": "Aucun nœud sélectionné",
  "connectionStatus": "État de la connexion:",
  "online": "En ligne",
  "offline": "Hors ligne",
  "note": "Note:",
  "mode": "Mode:",
  "singleNodeConnection": "Connexion nœud unique",
  "initialSpeedTesting": "Test de vitesse initial...",
  "testAllSpeed": "Tester toutes les vitesses",
  "testing": "Test en cours...",
  "gunRelays": "Relais Gun",
  "currentlyInUse": "Actuellement utilisé",
  "testingLatency": "Test en cours...",
  "notTested": "Non testé",
  "switchToThisNode": "Basculer vers ce nœud",
  "testLatency": "Tester la latence",
  "removeRelay": "Supprimer le relais",
  "relayURL": "URL du relais",
  "status": "Statut",
  "connectionLatency": "Latence de connexion",
  "enterRelayURL": "Entrer l'URL du relais",
  "searchRelays": "Rechercher des relais...",
  "checking": "Vérification",
  "close": "Fermer",
  "enableThisNode": "Activer ce nœud",
  "enabled": "Activé",
  "nodesEnabled": "nœuds activés",
  "networkAvailable": "Réseau disponible",
  "networkUnavailable": "Réseau indisponible",
  "verifiedStatus": "Vérifié",
  "syncingStatus": "Synchronisation...",
  "unverifiedStatus": "Non vérifié",
  "relationshipVerified": "Relation vérifiée",
  "verifying": "Vérification...",
  "relationshipUnverified": "Relation non vérifiée",
  "startGroupChat": "Démarrer un chat de groupe",
  "addFriendTitle": "Ajouter un ami",
  "groupName": "Nom du groupe",
  "enterGroupName": "Entrez le nom du groupe",
  "searchContacts": "Rechercher des contacts",
  "contacts": "Contacts",
  "noContacts": "Aucun contact",
  "sendGroupInvitation": "Envoyer une invitation de groupe",
  "pinnedChats": "Chats épinglés",
  "recentChats": "Chats récents",
  "noMessagesYet": "Aucun message pour le moment",
  "areYouSure": "Êtes-vous sûr?",
  "groupCreatedSuccessfully": "Groupe créé avec succès",
  "failedToCreateGroup": "Échec de la création du groupe",
  "pleaseEnterGroupName": "Veuillez entrer un nom de groupe",
  "pleaseEnterGroupKey": "Veuillez entrer une clé de groupe",
  "joinedGroupSuccessfully": "Groupe rejoint avec succès",
  "failedToJoinGroup": "Échec de la participation au groupe",
  "keyPairCopied": "Paire de clés copiée",
  "failedToCopyKeyPair": "Échec de la copie de la paire de clés",
  "confirmDelete": "Confirmer la suppression",
  "confirmDeleteGroup": "Êtes-vous sûr de vouloir supprimer le groupe {groupName} ? Cette action ne peut pas être annulée.",
  "cancel": "Annuler",
  "groupDeleted": "Groupe supprimé",
  "failedToDeleteGroup": "Échec de la suppression du groupe",
  "createGroupFailedGetKeyPair": "Échec de la création du groupe, impossible d'obtenir la paire de clés",
  "invitationSent": "Groupe '{groupName}' créé avec succès, et invitation envoyée à {count} contacts",
  "invitationFailed": "Échec de la création du groupe ou de l'envoi de l'invitation, veuillez réessayer",
  "Chats": "Chats",
  "Rooms": "Salles",
  "keyPair": "Paire de clés",
  "loadingKeyPair": "Chargement de la paire de clés...",
  "encryptedKeyPairWarning": "Ceci est votre paire de clés chiffrée. Gardez-la en sécurité !",
  "relayToast": "Relais : {url}",
  "noStrangerRelays": "Aucun relais étranger à ajouter.",
  "keyPairCopiedToClipboard": "Paire de clés copiée dans le presse-papiers",
  "copyFailed": "La copie a échoué",
  "keyPairLoadedFromCredentials": "Paire de clés chargée à partir des informations d'identification",
  "noEncryptedKeyPairFound": "Aucune paire de clés chiffrée trouvée",
  "GunOS": "GunOS",
  "relaySettings": "Paramètres du relais",
  "aiSettings": "Paramètres de l'IA",
  "aiChat": "Chat IA",
  "clickToViewAll": "Cliquez pour tout voir",
  "newMoment": "Nouveau moment",
  "addImages": "Ajouter des images",
  "requestTimedOut": "La requête a expiré",
  "storageMonitor": "Moniteur de stockage",
  "cacheStatus": "État du cache",
  "cacheSize": "Taille du cache",
  "cacheMemory": "Mémoire cache",
  "clearing": "Nettoyage...",
  "clearCache": "Vider le cache",
  "dbContents": "Contenu de la base de données",
  "totalRecords": "Total des enregistrements",
  "allRecords": "Tous les enregistrements",
  "userData": "Données utilisateur",
  "chatsData": "Données de chat",
  "fetching": "Récupération...",
  "refreshRecords": "Actualiser les enregistrements",
  "clearDb": "Vider la base de données",
  "noDbRecords": "Aucun enregistrement trouvé dans la base de données.",
  "logs": "Journaux",
  "Room": "Salle",
  "userGuideContent": "Bienvenue dans TalkFlow ! Il s'agit d'une application de chat décentralisée qui vous permet de communiquer de manière sécurisée et privée avec vos amis.\n\nFonctionnalités principales :\n• Chat chiffré de bout en bout\n• Architecture décentralisée\n• Aucun serveur central requis\n• Support de transfert de fichiers\n• Fonctionnalité de notification à distance\n\nCommencer :\n1. Ajoutez la clé publique de votre ami\n2. Commencez à discuter en toute sécurité\n3. Profitez de la communication privée",
  "currentChatFriendInfo": "Informations de l'ami de chat actuel",
  "friendName": "Nom de l'ami",
  "noFriendSelected": "Aucun ami sélectionné",
  "currentFriendRemoteNotificationConfig": "Configuration de notification à distance de l'ami actuel",
  "updateFromUrl": "Mettre à jour depuis l'URL",
  "saveConfig": "Enregistrer la configuration",
  "deleteConfig": "Supprimer la configuration",
  "testSend": "Test d'envoi",
  "myRemoteNotificationConfig": "Ma configuration de notification à distance",
  "myBarkConfig": "Ma configuration Bark",
  "enterYourBarkUrl": "Entrez votre URL Bark",
  "note": "Note",
  "barkDescription": "Bark est une application de notification push qui vous permet de recevoir des notifications personnalisées sur les appareils iOS. Vous devez télécharger l'application Bark depuis l'App Store et obtenir votre clé d'appareil.",
  "currentChatFriend": "Ami de chat actuel",
  "nickname": "Surnom",
  "publicKey": "Clé publique",
  "remoteNotificationCertificate": "Certificat de notification à distance",
  "configured": "Configuré",
  "notConfigured": "Non configuré",
  "remoteNotificationContent": "Contenu de notification à distance",
  "enterCustomContent": "Entrer un contenu personnalisé",
  "sendRemoteNotification": "Envoyer une notification à distance",
  "sendMyNotificationCertificateToFriend": "Envoyer mon certificat de notification à l'ami",
  "revokeOtherNotificationCertificate": "Révoquer le certificat de notification de l'autre",
  "myConfigStatus": "Statut de ma configuration",
  "myBarkUrlLabel": "Mon URL Bark",
  "barkUrlPlaceholder": "Entrez l'URL Bark complète",
  "notificationServerDomain": "Domaine du serveur de notification",
  "deviceKey": "Clé d'appareil",
  "saveMyConfig": "Enregistrer ma configuration",
  "testMyNotification": "Tester ma notification",
  "notificationSwitchInBarkApp": "Veuillez activer le commutateur de notification dans l'application Bark",
  "deviceKeyFromBarkApp": "La clé d'appareil peut être obtenue depuis l'application Bark",
  "supportCustomNotificationServer": "Support du serveur de notification personnalisé",
  "pleaseConfigureFriendNotification": "Veuillez d'abord configurer la notification à distance de l'ami",
  "youHaveNewMessage": "Vous avez un nouveau message",
  "talkflowMessage": "Message TalkFlow",
  "remoteNotificationSentSuccessfully": "Notification à distance envoyée avec succès",
  "failedToSendRemoteNotification": "Échec de l'envoi de la notification à distance",
  "pleaseConfigureYourNotification": "Veuillez d'abord configurer votre notification à distance",
  "notificationCertificateSentSuccessfully": "Certificat de notification envoyé avec succès",
  "failedToSendCertificate": "Échec de l'envoi du certificat",
  "pleaseSelectChatFriend": "Veuillez d'abord sélectionner un ami de chat",
  "otherNotificationCertificateRevoked": "Certificat de notification de l'autre révoqué",
  "failedToRevokeCertificate": "Échec de la révocation du certificat",
  "pleaseEnterValidBarkUrl": "Veuillez d'abord entrer une URL Bark valide",
  "myConfigSavedSuccessfully": "Ma configuration enregistrée avec succès",
  "failedToSaveConfig": "Échec de l'enregistrement de la configuration",
  "talkflowTest": "Test TalkFlow",
  "thisIsTestNotification": "Ceci est une notification de test",
  "testNotificationSentSuccessfully": "Notification de test envoyée avec succès",
  "testNotificationFailed": "Échec de la notification de test",
  "unableToSendMissingChatOrConfig": "Impossible d'envoyer : cible de chat ou configuration manquante",
  "remoteNotificationCertificateSent": "Certificat de notification à distance envoyé",
  "sendFailedPleaseTryAgain": "Échec de l'envoi, veuillez réessayer",
  "unableToSendDeleteRequestMissingInfo": "Impossible d'envoyer la demande de suppression : informations nécessaires manquantes",
  "deleteCertificateRequestSent": "Demande de suppression de certificat envoyée",
  "sendDeleteRequestFailedPleaseTryAgain": "Échec de l'envoi de la demande de suppression, veuillez réessayer",
  "pleaseEnterBarkUrl": "Veuillez entrer l'URL Bark",
  "configNotEnabled": "Configuration non activée",
  "testNotification": "Notification de test",
  "testNotificationSendFailed": "Échec de l'envoi de la notification de test",
  "friendConfigNotEnabled": "Configuration de l'ami non activée",
  "chatPageRemoteNotificationCert": "Certificat de notification à distance",
  "chatPageAcceptedRemoteNotificationCert": "Configuration du certificat de notification à distance acceptée",
  "chatPageSecurityCertDeleted": "Certificat de sécurité supprimé",
  "chatPageRemoteNotificationCertDeleted": "Certificat de notification à distance supprimé",
  "chatPageClickToAcceptRemoteNotification": "Cliquez pour accepter la configuration des notifications à distance",
  "chatPageAccept": "Accepter",
  "chatPageRevokeRemoteNotificationCert": "Révoquer le certificat de notification à distance",
  "chatPageRemoteNotificationCertRevoked": "Certificat de notification à distance révoqué avec succès",
  "chatPageRemoteNotification": "Notification à distance",
  "chatPageJoinGroup": "Rejoindre le groupe",
  "chatPageGroupChatInvitation": "Invitation de chat de groupe",
  "chatPageClickToAcceptRemoteNotification": "Cliquez pour accepter de configurer les notifications à distance",
  "chatPageAccept": "Accepter",
  "chatPageRevokeRemoteNotificationCertificate": "Révoquer le certificat de notification à distance",
  "chatPageRemoteNotificationCertificateSuccessfullyRevoked": "Certificat de notification à distance révoqué avec succès",
  
  "notificationSettingsTitle": "Guide de Configuration des Notifications à Distance",
  "aboutRemoteNotifications": "À propos des Notifications à Distance",
  "iosNotificationDescription": "Dans iOS, APNs est requis pour la meilleure expérience de notification, tandis que nous nous efforçons de rendre tout auto-hébergeable par les utilisateurs. Par conséquent, nous utilisons par défaut Bark comme outil principal de notification à distance dans iOS.",
  "linuxAndroidPwaDescription": "Dans les versions Linux-Android-PWA, vous pouvez personnaliser les pilotes matériels, ce qui signifie que les notifications que vous recevez peuvent être traitées par d'autres appareils sans être envoyées à des serveurs tiers.",
  "privacyConsiderationDescription": "Pour des considérations de confidentialité, nous faisons des notifications à distance un choix indépendant, car les messages avec notifications à distance seront envoyés au serveur de notification à distance, qui les envoie ensuite à votre appareil et déclenche des API pilotées par le matériel pour faire vibrer votre appareil et rendre le contenu. Pour les versions non-iOS, les notifications à distance ne passent que par votre propre serveur.",
  "respectConsiderationDescription": "De plus, par respect, nous ne forçons pas chaque message à inclure des notifications à distance. Vous pouvez envoyer des messages privés absolument chiffrés à d'autres.",
  "finalReminderLabel": "Rappel final :",
  "finalReminderDescription": "Le contenu des notifications à distance sera envoyé à votre serveur de notification choisi pour transmission, tandis que les messages sans notifications à distance sont envoyés via un chiffrement point-à-point de réseau maillé.",
  "barkConfigurationSteps": "Étapes de Configuration Bark",
  "step1Title": "Télécharger et Installer l'App Bark",
  "step1Description": "Recherchez et téléchargez l'application \"Bark\" dans l'App Store, qui est un outil gratuit de notification push iOS.",
  "goToAppStore": "Aller à l'App Store",
  "goToGitHub": "Aller sur GitHub",
  "step2Title": "Obtenir la Clé d'Appareil",
  "step2Description1": "Ouvrez l'application Bark, et vous verrez une URL comme celle-ci :",
  "step2Description2": "Copiez cette URL complète, qui est votre adresse push Bark.",
  "deviceKeyNote": "La clé d'appareil est unique, veuillez la garder en sécurité",
  "step3Title": "Configurer dans TalkFlow",
  "step3Description": "Collez l'URL Bark copiée dans la boîte de saisie URL API dans le module de configuration de notification à distance dans le coin supérieur droit de la liste de conversation TalkFlow, puis envoyez un certificat de notification à distance à l'autre partie pour commencer à recevoir des notifications à distance.",
  "features": "Fonctionnalités",
  "privacyProtectionFeature": "Protection de la Confidentialité",
  "privacyProtectionDescription": "Prend en charge les serveurs auto-hébergés, les données sont complètement sous votre contrôle",
  "instantNotificationFeature": "Notifications Instantanées",
  "instantNotificationDescription": "Recevez des notifications de messages en temps réel, ne manquez aucune information importante",
  "certificateControlFeature": "Permissions de Notification à Distance Contrôlées par Certificat",
  "certificateControlDescription": "Seuls ceux que vous autorisez peuvent vous envoyer des notifications à distance, respectant votre confidentialité et liberté.",
  "endToEndEncryptionFeature": "Chiffrement de Bout en Bout",
  "endToEndEncryptionDescription": "Utilise des suites cryptographiques de standard de sécurité militaire et des protocoles de communication chiffrés, les messages utilisent une transmission de double chiffrement point-à-point innovante",
  "needHelp": "Besoin d'Aide ?",
  "helpDescription": "Si vous rencontrez des problèmes pendant la configuration, vous pouvez consulter les ressources suivantes :",
  "barkOfficialDocs": "Documentation Officielle Bark",
  "talkFlowHelp": "Aide TalkFlow",
  "call1": "Copier le lien de partage de la salle actuelle",
"call2": "Rejoindre la salle avec le lien de partage",
"call3": "Coller le lien de partage de la salle ici",
"call4": "Rejoindre la salle",
"call5": "Coller depuis le presse-papiers",
"call6": "Serveur de signalisation",
"call7": "Guide pour déployer un serveur de signalisation privé",
"call8": "Clé de chiffrement des appels",
"call9": "Régénérer la clé"
  ,
  "webllm": {
    "sidebar": {
      "newConversation": "Nouvelle conversation",
      "refresh": "Actualiser",
      "export": "Exporter",
      "delete": "Supprimer",
      "empty": "Aucun historique de conversation"
    },
    "warning": {
      "noWebGPU": "WebGPU non détecté ; performances potentiellement réduites."
    },
    "controls": {
      "currentModel": "Modèle actuel :",
      "runtimeMode": "Mode d’exécution :",
      "model": "Modèle",
      "modelPlaceholder": "ex. : Qwen2-1.5B-Instruct-q4f32_1-MLC"
    },
    "common": {
      "apply": "Appliquer",
      "available": "Disponible",
      "unavailable": "Indisponible"
    },
    "consent": {
      "tip": "Modèle non chargé. La première utilisation nécessite un téléchargement et une mise en cache locale.",
      "loadDefault": "Accepter et charger le modèle par défaut",
      "confirm": "La première utilisation nécessite une mise en cache locale du modèle. Continuer ?"
    },
    "settings": {
      "more": "Plus de paramètres",
      "title": "Paramètres WebLLM",
      "close": "Fermer",
      "runtimeMode": "Mode d’exécution",
      "webgpuAvailable": "WebGPU disponible",
      "installedModels": "Modèles installés",
      "noInstalledModels": "Aucun modèle installé",
      "inUse": "En cours d’utilisation",
      "use": "Utiliser",
      "delete": "Supprimer",
      "builtInModels": "Modèles intégrés",
      "pullRemoteModel": "Récupérer un modèle distant",
      "remoteModelPlaceholder": "Saisir l’ID du modèle, ex. : Qwen2-1.5B-Instruct-q4f32_1-MLC",
      "pullAndUse": "Récupérer et utiliser",
      "importLocal": "Import local",
      "generationParams": "Paramètres de génération",
      "enableThinking": "Activer le mode pensée (Qwen3)",
      "logLevel": "Niveau de journal"
    },
    "autoreply": {
      "title": "Paramètres de réponse automatique",
      "replyAll": "Répondre automatiquement à tous les amis",
      "targeted": "Réponse ciblée (priorité supérieure)",
      "selectBuddies": "Sélectionner des amis pour activer la réponse automatique"
    },
    "import": {
      "notSupported": "Import local non pris en charge ; veuillez récupérer via l’ID de modèle."
    }
  }
  ,
  "modelPersona": {
    "title": "Réglage du modèle · Paramètres de persona",
    "currentModel": { "label": "Modèle actuel" },
    "personaSegments": {
      "label": "Segments prédéfinis composés",
      "tip": "Ajoutez plusieurs invites system/user/assistant; elles sont injectées en tête du contexte dans l’ordre.",
      "addSystem": "Ajouter un segment System",
      "addUser": "Ajouter un segment User",
      "addAssistant": "Ajouter un segment Assistant"
    },
    "segment": {
      "placeholder": "Texte d’invite pour ce segment",
      "actions": { "moveUp": "Monter", "moveDown": "Descendre", "remove": "Supprimer" }
    },
    "systemPrompt": {
      "label": "Invite système (optionnel)",
      "tip": "Ajoutez ici une invite système distincte si nécessaire; elle est prioritaire et injectée avant les segments composés.",
      "placeholder": "Invite système supplémentaire (optionnel)"
    }
  }
}