{
  "next": "Далее",
  "hello": "Привет, мир",
  "password": "Пароль",
  "username": "Имя пользователя",
  "register": "Создать ключ",
  "register1": "Сгенерировать ключ и зашифровать",
  "login": "Расшифровать и войти",
  "back": "Назад",
  "setting": "Настройки",
  "resetPassword": "Сбросить пароль",
  "forgotPassword": "Забыли пароль",
  "logout": "Выйти",
  "talkflowid": "Ключ идентификации",
  "blacklist": "Черный список",
  "myblacklist": "Мой черный список",
  "addblacklist": "Добавить в черный список",
  "deleteblacklist": "Удалить из черного списка",
  "keysecuritydetection": "Проверка безопасности ключа",
  "datamigration": "Миграция данных",
  "cachemanagement": "Управление кэшем",
  "clearthechatrecords": "Очистить записи чата",
  "destroythekey": "Уничтожить ключ",
  "accountsettings": "Настройки учетной записи",
  "notify": "Уведомление",
  "colosenotify": "Отключить уведомления",
  "Toast": "Всплывающее уведомление",
  "language": "Язык",
  "help": "Помощь",
  "setforme": "Настройка учетной записи",
  "mynode": "Мой узел",
  "friendkey": "Ключ идентификации друга",
  "addfriend": "Отправить запрос в друзья",
  "close": "Закрыть",
  "addfriend1": "Добавить друга",
  "addfriend2": "Отправить запрос",
  "remarkname": "Заметка",
  "remarks": "Информация о заметке",
  "save": "Сохранить",
  "delete": "Удалить",
  "hide": "Скрыть",
  "afriend": "Проверенное отношение",
  "sendmessage": "Отправить сообщение",
  "scanner": "Сканер",
  "qrcodetool": "Инструмент QR-кода",
  "offlinewebtools": "Оффлайн веб-инструменты",
  "relay": "Ретранслятор",
  "onlineequipment": "Онлайн-устройства",
  "historicalequipment": "Исторические устройства",
  "refreshstatus": "Обновить статус",
  "exportdata": "Экспорт данных",
  "importdata": "Импорт данных",
  "datamigrationtalk": "Убедитесь, что оба устройства находятся в одном узле или установлено одноранговое соединение, и оба устройства имеют расшифрованные пары ключей и остаются онлайн. Содержимое миграции включает: базовые персональные данные - контакты - список сеансов - записи чата в текстовом формате и аудиоформата AAC.",
  "importdatatalk": "Пожалуйста, введите код синхронизации",
  "importdatatalk1": "Начать импорт",
  "importdatatalk2": "Убедитесь, что текущее устройство подключено к тому же действующему узлу, что и устройство экспорта",
  "importdatatalk3": "Импорт данных",
  "importdatatalk4": "Прогресс",
  "exportdatatalk1": "Начать экспорт",
  "exportdatatalk2": "Подготовка к экспорту данных...",
  "exportdatatalk3": "Убедитесь, что текущее устройство подключено к действующему узлу.",
  "exportdatatalk4": "Экспорт завершен",
  "exportdatatalk5": "Пожалуйста, используйте следующий код синхронизации для импорта на новом устройстве",
  "addfriendtalk": "Пожалуйста, введите сообщение",
  "agree": "Согласиться",
  "refuse": "Отказаться",
  "notethename": "Имя заметки",
  "Remarks": "Информация о заметке",
  "savesettings": "Сохранить настройки",
  "deletefriend": "Удалить друга",
  "sending": "Отправка",
  "htmltalk": "Это инструмент для создания оффлайн-веб-страниц. После ввода контента и установки пароля выберите шифрование, и будет возвращена ссылка. Просто скопируйте ссылку в браузер, чтобы получить доступ к сгенерированному контенту. Конечно, вы можете не устанавливать пароль; это дополнительная опция.",
  "relaytalk": "TalkFlow передает и публикует данные в распределенной сети в реальном времени через ретрансляторы. Это ядро всего. По умолчанию используются официальные одноранговые узлы, но вы также можете использовать свой собственный частный узел или открыть свой частный узел в публичную сеть для связи с большим количеством людей. Инструмент управления ретрансляторами готов, он прошел множество стресс-тестов и является очень стабильной и надежной версией. Расширьте свой список ретрансляторов!",
  "versiontalk": "Примечания к версии - v1.0",
  "versiontalk1": "Эта версия не включает все функции; пожалуйста, дождитесь обновлений. В разработке находятся: уведомления на экране блокировки APNs - надежная передача больших зашифрованных файлов - надежная зашифрованная голосовая и видеосвязь в реальном времени - переносной порт игрового сервера - более мощный настольный порт для Windows, Linux и macOS на основе ollama - версии Pro и управления жестами в смешанной реальности для Oculus Quest и Pico - сообщество публичных узлов (эта функция может не пройти проверку, поэтому ее открытие отложено) - групповой чат (в настоящее время реализован, но не стабилен, может быть доступен в следующей версии; уровень шифрования для частной связи выше). Частная зашифрованная связь в текущей версии надежна. Вы можете подключиться к настольному клиенту с частным ИИ или дроном. Настольный порт открыл интерфейсы ИИ и контроллера; просто настройте узел и добавьте ИИ в друзья, чтобы общаться с вашим частным ИИ через децентрализованную сеть."

,
"eula": {
  "title": "最终用户许可协议",
  "lastUpdated": "最后更新：2025年3月12日",
  "sections": {
    "acceptance": {
      "title": "1. 接受条款",
      "content": "使用 TalkFlow（以下简称“本应用”）即表示您同意受本最终用户许可协议（以下简称“EULA”）的约束。如果您不同意，请勿使用本应用。"
    },
    "license": {
      "title": "2. 许可授予",
      "content": "TalkFlow 授予您非独占、不可转让的许可，允许您出于个人或商业目的使用本应用，但须遵守本 EULA 的条款。本应用基于去中心化网络运行，您对数据和密钥的管理由您自行负责。"
    },
    "conduct": {
      "title": "3. 用户行为",
      "content": "您同意不将本应用用于以下用途：<br>- 发布、分享或传输任何不当内容，包括但不限于仇恨言论、骚扰、暴力、色情或非法内容。<br>- 对其他用户实施滥用行为，例如发送垃圾信息、挑衅、威胁或恶意干扰网络节点。<br>- 违反任何适用法律或法规，包括但不限于数据隐私法和通信法规。"
    },
    "moderation": {
      "title": "4. 内容审查",
      "content": "对于通过公共公开节点网络传输的内容，TalkFlow 保留监控、审查和屏蔽违反本 EULA 的用户生成内容的权利。对于私人节点或对等连接中的内容，您自行负责管理。如发现不当内容，您可以通过应用内举报功能或邮箱 zhangguoai888@gmail.com 联系我们进行报告。"
    },
    "termination": {
      "title": "5. 终止",
      "content": "如果您违反本 EULA，我们可能会在通知或不通知的情况下暂停或终止您对本应用的访问权限。去中心化网络中的数据可能仍由其他节点保留，我们对此不承担责任。"
    },
    "warranty": {
      "title": "6. 无担保",
      "content": "本应用按“现状”提供，不提供任何明示或暗示的担保，包括但不限于对去中心化网络稳定性和数据传输可靠性的担保。由于其去中心化特性，服务可用性可能受网络状况影响。"
    },
    "liability": {
      "title": "7. 责任限制",
      "content": "TalkFlow 对因您使用本应用而产生的任何损害（包括但不限于数据丢失、密钥丢失或第三方行为）不承担责任。本应用不提供密钥找回服务，因其去中心化属性，密钥丢失将导致无法访问相关加密数据，请妥善保管您的密钥。"
    },
    "changes": {
      "title": "8. EULA 修改",
      "content": "我们可能会随时更新本 EULA，更新后的版本将在应用内或通过官方渠道发布。继续使用本应用即表示您接受更新后的条款。"
    },
    "contact": {
      "title": "9. 联系方式",
      "content": "如有疑问或需要支持，请通过 zhangguoai888@gmail.com 联系我们。由于本应用去中心化特性，部分问题可能需要您自行排查节点或密钥相关设置。"
    },
    "agreement": {
      "content": "点击“我同意”即表示您已阅读、理解并同意本 EULA 的所有条款，并愿意承担使用去中心化实时通信服务所带来的责任与风险。"
    }
  },
  "buttons": {
    "agree": "我同意",
    "decline": "拒绝"
  }
},
"help1" : "Это приложение для общения с приоритетом оффлайн работы.",
"help2" : "Все данные хранятся только на вашем локальном диске и обновляются при необходимости через последние снимки данных из распределенной сети.",
"help3" : "Это означает, что ваш список контактов и личные данные не появятся где-либо, кроме мест, которые вы вручную настроили.",
"help4" : "Если вам нужно использовать приложение на разных устройствах или перенести данные на новое устройство, перейдите на страницу настроек и выберите миграцию данных. Экспортируйте данные с устройства и импортируйте их на новое устройство, убедившись, что оба устройства используют одну и ту же пару ключей и узлы сети, а также остаются в состоянии входа. Если вы хотите использовать собственные узлы сети, настройте их вручную в разделе relay; по умолчанию используются официальные узлы. Передаваемые данные включают: список контактов, историю переписки, записи об устройствах.",
"help5" : "Если вы хотите расширить возможности ИИ и контроллеров Интернета вещей, используйте версии для MacOS или Windows для развертывания частного сервиса. Добавьте серверный узел в друзья. Таким образом, вы сможете через мобильное устройство общаться на расстоянии через распределенную сеть с ИИ или другими устройствами Интернета вещей, такими как дроны.",
"help6" : "Как добавить друга?",
"help7" : "В меню в правом верхнем углу страницы контактов вы можете вручную скопировать и вставить публичный ключ собеседника или отсканировать его QR-код с помощью сканера, чтобы отправить запрос на добавление в друзья.",
"help8" : "Как принять запрос на добавление в друзья?",
"help9" : "В меню в левом верхнем углу страницы контактов вы можете перейти к списку запросов на добавление в друзья и выбрать тех, кого хотите добавить. Если вы считаете, что пользователь вас беспокоит, мы предоставляем функцию черного списка. Вы можете добавить его в черный список, и данные от этого пользователя больше не будут поступать.",
"help10" : "Дополнение о добавлении друзей:",
"help11" : "Личные данные связи не генерируются автоматически из соображений безопасности, включая предотвращение подделки личности. При первом общении с собеседником на вашем устройстве локально создаются уникальный сертификат связи и идентификатор связи для вас и вашего собеседника. После добавления друга найдите его в списке контактов, перейдите на страницу диалога и отправьте произвольное сообщение, чтобы локально создать сертификат и идентификатор связи. То же самое должен сделать собеседник. Сертификаты для вас и вашего друга независимы, но для расшифровки и общения требуются пары ключей и сертификаты обеих сторон."



,
  "sponsor": "Спонсорство",
  "sponsor1": "Поддержите TalkFlow",
  "sponsor2": "Присоединяйтесь к нам, чтобы ускорить инновации в коммуникациях. Станьте спонсором прямо сейчас!",
  "sponsor3": "Ваше спонсорство будет распределено между всеми, кто внес вклад в TalkFlow!",
  "sponsor4": "Ваше имя будет добавлено в список спонсоров TalkFlow!",
  "sponsor5": "Контакты для спонсорства",
  "sponsor6": "Участники TalkFlow",
  "sponsor7": "Автор TalkFlow - Создал основную платформу TalkFlow и коммуникационную систему на базе Gun-Relay.",
  "sponsor8": "Автор GunJs - Предоставил TalkFlow мощную распределенную базу данных в реальном времени.",
  "sponsor9": "Автор Gun-Vue и Gun-Avatar - Предоставил TalkFlow стабильные базовые компоненты и забавные аватары.",
  "sponsor10": "Марк и участники сообщества Gun с открытым исходным кодом бесплатно пожертвовали десятилетия усилий всем, обеспечив TalkFlow надежную долгосрочную техническую поддержку и помощь.",
  "sponsor11": "Технологический стек TalkFlow",
  "sponsor12": "TalkFlow построен с использованием передовых инструментов и языков, обеспечивая надежный и масштабируемый опыт:",
  "sponsor13": "Языки программирования:",
  "sponsor14": "База данных:",
  "sponsor15": "Инструменты:",

  "github": "Развертывание ретранслятора",
  "github1": "GunRelay-TalkFlow - это узел ретрансляции TalkFlow на базе GUN.",
  "github2": "Получите независимые коммуникационные возможности через децентрализованный узел ретрансляции.",
  "github3": "Позволяет настроить узел ретрансляции для TalkFlow с использованием GUN (децентрализованной графовой базы данных). Узел ретрансляции обеспечивает синхронизацию данных в реальном времени между устройствами, гарантируя бесперебойную и безопасную связь. Будь вы разработчиком или энтузиастом, развертывание собственного ретранслятора - важный шаг к будущему глобальной децентрализованной распределенной сети. Когда мы достигнем Марса, это быстро восстановит наш сетевой опыт с Земли.",
  "github4": "Посетить репозиторий GitHub"
,"github5": "Разверните его самостоятельно через репозиторий GitHub ниже. Вы можете напрямую использовать исходный код для создания предпочитаемого внешнего вида или расширения функциональности, а также создать собственный установочный пакет или запустить его напрямую с помощью команд терминала. После успешного запуска децентрализованный узел ретрансляции автоматически активируется без дополнительной настройки."



}